// Задача 29: Напишите программу, которая задаёт случайный массив случайного размера (от 5 до 10) элементов 
// (значение элементов от 1 до 40) и выводит на экран массив квадратов этих чисел.
// 1, 2, 5, 7, 19 -> [2, 4, 25, 49, 361]
// 6, 1, 33 -> [36, 1, 1089]
namespace NomeWorkTask29
{
    class Program
    {
        public static void Main(string[] args)
        {
            // Console.Clear();
            // Console.WriteLine("Введите число");
            // string? str = (Console.ReadLine());
            // int sum = 0;
            // for (int i = 0; i < str.Length; i++)
            // {
            //     sum +=
            //     int.Parse((str[i]).ToString());
            // }
            // Console.WriteLine(sum);
        }
    }
}