namespace HelloWorld
{
    class Program
    {
        // ДЗ2_Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
        static void Main(string[] args)
        {
            string 1 = "Понедельник"
            string 2 = "Вторник"

            
            Console.WriteLine("Число дня недели: ");
            int number = Convert.ToInt32(Console.ReadLine());
            string str = number.ToString();
            
            
           
        }
    }
}